/**
 * Created by Игорь on 28.10.2016.
 * Выведите первые 5 элементов массива, у которого размер 10
 */
public class Ex1 {
    public static void main(String[] args) {
        int[]x = {1,2,3,4,5,6,7,8,9,10};
        for(int i = 0;i<5;i++){
            System.out.println(x[i]);
        }
    }
}
